<html>
	<head>
		<title>ADIS'2009</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
		<style type="text/css">@import url(./default.css);
	</style></head>
<body>

<div class="datos">
<h1>ADIS'09</h1>
<h2>Apoyo a la Decisi&oacute;n en Ingenier&iacute;a del Software<br />Decision-making in Software Engineering</h2> (<a href="./WorkshopADIS2009.pdf">CFP in pdf -Spanish-</a>)(<a href="./English.WorkshopADIS2009.pdf">CFP in pdf -English-</a>)
<a href="http://www.cc.uah.es/drg/adis2009/">http://www.cc.uah.es/drg/adis2009/</a>
<br /><br />
<h3>Evento realizado en el marco de las XIII Jornadas de Ingenier&iacute;a del Software y Bases de Datos (JISBD 2009)</h3>
<a href="http://www.sistedes.es/jisbd2009/">http://www.sistedes.es/jisbd2009/</a>
</div>

<div class="parrafo">
			<h2>Introducci&oacute;n</h2>
Durante los &uacute;ltimos a&ntilde;os se ha incrementado el n&uacute;mero de los investigadores en Ingenier&iacute;a del Software y Bases de Datos que hacen uso de nuevas t&eacute;cnicas y herramientas anteriormente poco usadas en estos campos. As&iacute; el uso de heur&iacute;sticas de planificaci&oacute;n y/o b&uacute;squeda, de dise&ntilde;o de experimentos, de miner&iacute;a de datos, etc. ha abierto nuevas posibilidades para la gesti&oacute;n de los sistemas de informaci&oacute;n. Problemas como la planificaci&oacute;n y toma de decisiones en los procesos ligados a la producci&oacute;n de software, la b&uacute;squeda de patrones en errores, el dise&ntilde;o de almacenes de datos para la extracci&oacute;n de conocimiento, miner&iacute;a de datos en repositorios software, predicci&oacute;n de esfuerzo en el mantenimiento, generaci&oacute;n de modelos de pruebas, extracci&oacute;n de conocimiento de la Web, tienen un importante punto de apoyo en un conjunto de t&eacute;cnicas que actualmente se agrupan bajo el concepto de Soft-Computing.
<br /><br />
Bajo el nombre de Soft-Computing se agrupan un conjunto de metodolog&iacute;as como las metaheur&iacute;sticas de b&uacute;squeda y optimizaci&oacute;n, las t&eacute;cnicas usadas en miner&iacute;a de datos y aprendizaje autom&aacute;tico, la l&oacute;gica borrosa y otras l&oacute;gicas probabil&iacute;sticas, etc. Estas t&eacute;cnicas muy usadas en otras en ingenier&iacute;as est&aacute;n teniendo un importante auge en las publicaciones en Sistemas de Informaci&oacute;n, queriendo aportar con este Taller un foro de discusi&oacute;n sobre las perspectivas que la comunidad JISBD ve en esta l&iacute;nea de trabajo.
</div>
		
		
<div class="parrafo">
<h2>Motivaci&oacute;n</h2>	
En la gesti&oacute;n y desarrollo de los sistemas de informaci&oacute;n se deben tomar m&uacute;ltiples decisiones en innumerables situaciones del desarrollo y mantenimiento de sistemas software. Las tareas en las que es preciso tomar decisiones acertadas comienzan en las evaluaciones iniciales sobre la correcci&oacute;n de los requisitos, evaluaci&oacute;n de las arquitecturas, dise&ntilde;os, prototipos y otros elementos de las estructuras de las aplicaciones. En las fases de dise&ntilde;o, codificaci&oacute;n y pruebas
los t&eacute;cnicos tambi&eacute;n deben tomar decisiones acerca de los productos intermedios. Adem&aacute;s en todas las actividades de gesti&oacute;n nos encontramos con alternativas que el jefe de proyecto debe resolver adecuadamente. Una vez que se dispone de informaci&oacute;n cuantitativa o cualitativa, se debe proceder a su correcto uso.
<br /><br />
En este seminario se desea conversar tanto sobre dominios de aplicaci&oacute;n como sobre los &uacute;tiles, m&eacute;todos y herramientas que ayudan a la toma de decisiones. Este a&ntilde;o se quiere trabajar especialmente con t&eacute;cnicas provenientes del <em>soft-computing</em>, como son las heur&iacute;sticas de optimizaci&oacute;n y la miner&iacute;a de datos. Con ello se pretende la extracci&oacute;n de conocimiento con la finalidad de ayudar a un correcto desarrollo software, dar soporte a predicciones, y explotar este conocimiento para planificar desarrollos
futuros y/o mantenimiento.
<br /><br />
Un objetivo espec&iacute;fico de este taller es el de estudiar el concepto de <em>software mining</em> con el que la comunidad de investigadores est&aacute; trabajando para analizar y utilizar los datos almacenados en repositorios de datos, y as&iacute; llegar m&aacute;s lejos en el entendimiento del desarrollo software. Adem&aacute;s se desea encontrar paralelismos con otras disciplinas y tambi&eacute;n estudios relacionados con modelos concretos y aplicados de toma de decisiones.
</div>		
		

		
		
<div class="datos">
  <H2>Temas de inter&eacute;s</H2>
 	<p>Temas de inter&eacute;s del taller incluyen, entre otros:</p>
	<ul>	
	<li>Estudios, aplicaciones, y herramientas para extraer informaci&oacute;n de los repositorios de IS</li>
	<li>Soft Computing y metaheur&iacute;stica en la ingenier&iacute;a del software </li>
	<li>Sistemas din&aacute;micos aplicados a desarrollo software</li>
	<li>Visualizaci&oacute;n en proyectos software</li>
	<li>Detecci&oacute;n y predicci&oacute;n de fallos en m&oacute;dulos de software</li>
	<li>Predicci&oacute;n de esfuerzo y otras variables de proyectos software</li>
	<li>Modelado de almacenes de datos (repositorios de software)</li>
	<li>Tratamiento de problemas con bases de datos (p.e., bases de datos no balanceadas, ruido, outliers, selecci&oacute;n de atributos, etc.)</li>
	<li>Planificaci&oacute;n y scheduling</li>		
	<li>Web mining</li>
	<li>Etc.</li>
	</ul>
</div>	

<div class="parrafo">
<h2>Env&iacute;o y publicaci&oacute;n de trabajos</h2>
Los trabajos NO tienen que ser in&eacute;ditos, dado que la finalidad del taller es la de crear un foro de discusi&oacute;n donde se traten estos temas. sin embargo, existe la posibilidad de pedir un n&uacute;mero especial donde s&oacute;lo se podr&aacute;n considerar trabajos originales.
<br /> <br />
El art&iacute;culo no debe tener una longitud superior a 12 p&aacute;ginas en el formato recomendado por la organizaci&oacute;n de las JISBD (<a href="http://www.sistedes.es/jisbd2008/informacionautores-uk.html">Information for Authors</a>), y se enviar&aacute;n a los correos 
<a href="mailto:daniel.rodriguezg@uah.es">daniel.rodriguezg@uah.es</a> y <a href="mailto:robertoruiz@upo.es">robertoruiz@upo.es</a>. Las actas se publicar&aacute;n a trav&eacute;s de JISBD-SISTEDES.

</div>

<div class="parrafo">
<h2>Fechas importantes</h2>
	<ul>
		<li>Fecha l&iacute;mite para la recepci&oacute;n de contribuciones: <strong>10 Julio 2009</strong></li>
		<li>Comunicaci&oacute;n de resultados de revisi&oacute;n: <strong>17 Julio 2009</strong></li>
		<li>Versi&oacute;n definitiva de trabajos: <strong>24 julio 2009</strong></li>
		<li>Realizaci&oacute;n del taller: <strong>8 julio 2009</strong></li>
	</ul>
</div>

<div class="parrafo">
<h2>Coordinadores</h2>
	<ul>
	    <li>Jos&eacute; C. Riquelme, Universidad de Sevilla</li>
		<li>Roberto Ruiz, Universidad Pablo de Olavide (Sevilla)</li>
		<li>Daniel Rodr&iacute;guez, Universidad de Alcal&aacute; (Madrid)</li>
	</ul>
	<br />
	<h2>Comit&eacute; de programa</h2>
	<ul>
		<li>Jes&uacute;s Aguilar-Ruiz, Universidad Pablo de Olavide</li>
		<li>Enrique Alba, Universidad de M&aacute;laga
		<li>Javier Dolado, Universidad del Pa&iacute;s Vasco</li>
		<li>Mar&iacute;a Teresa G&oacute;mez, Universidad de Sevilla</li>
		<li>Isabel Ramos, Universidad de Sevilla</li>
		<li>Jos&eacute; C. Riquelme, Universidad de Sevilla</li>
		<li>Daniel Rodr&iacute;guez, Universidad de Alcal&aacute; (Madrid)</li>
		<li>Mercedes Ruiz, Universidad de C&aacute;diz</li>
		<li>Roberto Ruiz, Universidad Pablo de Olavide (Sevilla)</li>
		<li>Miguel &Aacute;ngel Sicilia, Universidad de Alcal&aacute; (Madrid)</li>
		<li>Javier Tuya, Universidad de Oviedo</li>
	</ul>
</div>



<div class="parrafo">
<h2>Ediciones anteriores</h2>
<ul>
<li><a href="http://www.sc.ehu.es/jiwdocoj/remis/adis2001.htm">ADIS 2001</a></li>
<li><a href="http://www.sc.ehu.es/jiwdocoj/remis/adis2002.htm">ADIS 2002</a></li>
<li><a href="http://www.sc.ehu.es/jiwdocoj/remis/cfpadis2003.htm">ADIS 2003</a></li>
<li><a href="http://www.sc.ehu.es/jiwdocoj/remis/cfpadis2004.htm">ADIS 2004</a></li>
<li><a href="http://www.sc.ehu.es/jiwdocoj/remis/cfpadis2005.htm">ADIS 2005</a></li>
<li><a href="http://www.sc.ehu.es/jiwdocoj/remis/cfpadis2006.htm">ADIS 2006</a></li>
<li><a href="http://www.sc.ehu.es/jiwdocoj/remis/cfpadis2007.htm">ADIS 2007</a></li>
<li><a href="http://www.cc.uah.es/drg/adis2009/">ADIS 2008</a></li>
</div>


</body>
</html>
